<template>
  <div id="app">
    <tree-item
      :item="data"
    ></tree-item>
  </div>
</template>

<script>

  import TreeItem from './components/TreeItem';

  export default {
    name: 'app',
    components: {
      TreeItem
    },
    data() {
      return {
        data: {
          name: 'Компания',
          children: [
            {name: 'Семёнов Андрей Егорович'},
            {name: 'Макарова Клавдия Даниловна '},
            {
              name: 'Прокофьев Ладимир Георгиевич',
              children: [
                {
                  name: 'Степанов Спиридон Анатольевич',
                  children: [
                    {name: 'Фомов Амадей Геннадьевич'},
                    {
                      name: 'Пешнин Иван Кириллович', children: [
                        {name: 'Сморчкова Харитина Матвеевна '},
                        {name: 'Рустамов Федосий Юрьевич'},
                        {name: 'Тарский Спиридон Геннадиевич'},
                        {
                          name: 'Шмидт Тимур Петрович', children: [
                            {name: 'Кудрявцева Агнесса Станиславовна '},
                            {name: 'Никитина Генриетта Владиславовна '},
                            {
                              name: 'Кондратьев Артём Максимович', children: [
                                {name: 'Арджеванидзе  Эвелина Егоровна '},
                                {name: 'Тихомирова Ульяна Васильевна '},
                                {name: 'Соболева Мальвина Егоровна ',
                                  children: [
                                    {name: 'Баженов Альберт Евгеньевич'},
                                    {name: 'Васютин Кондратий Петрович'},
                                    {name: 'Никитин Венедикт Степанович',
                                      children: [
                                        {name: 'Карпов Альфред Аркадьевич'},
                                        {name: 'Трофимов Аркадий Валентинович'},
                                        {name: 'Гусева Валерия Артемовна '}
                                      ]}
                                  ]}
                              ]
                            },
                            {name: 'Козырев Касьян Геннадьевич'}
                          ]
                        }
                      ]
                    },
                    {name: 'Изофатова Лилиана Станиславовна '},
                    {name: 'Арсеньев Максим Ярославович'}
                  ]
                },
                {
                  name: 'Павлова Устина Евгеньевна ', children: [
                    {
                      name: 'Конягина Стела Даниловна ', children: [
                        {name: 'Лапина Роза Валерьевна '},
                        {name: 'Арджеванидзе  Алла Григорьевна '},
                        {name: 'Захаров Иван Степанович'},
                        {name: 'Савельева Агния Дмитриевна '}
                      ]
                    },
                    {
                      name: 'Лукерин Парамон Денисович', children: [
                        {name: 'Баландина Влада Аркадьевна '},
                        {name: 'Савельев Радован Тарасович'},
                        {name: 'Быков Фёдор Максимович'},
                        {name: 'Городнова Наталья Васильевна '}
                      ]
                    },
                    {
                      name: 'Ерофеев Сигизмунд Евгеньевич', children: [
                        {name: 'Соболев Виталий Владимирович'},
                        {name: 'Рустамова Нона Тарасовна '},
                        {name: 'Веселкова Октябрина Викторовна '},
                        {name: 'Сысолятина Роза Ильинична '}
                      ]
                    },
                    {name: 'Борисов Гаврила и Гавриил Денисович'}
                  ]
                },
                {name: 'Баландин Валентин Геннадьевич'},
                {
                  name: 'Голубева Мира Платоновна ',
                  children: [
                    {name: 'Алексеев Авдей Миронович'},
                    {name: 'Белозёров Прохор Денисович'}
                  ]
                }
              ]
            }
          ]
        }
      }
    }
  }
</script>

<style>
  #app {
    padding: 50px;
  }
</style>
